# Demo Manipulación de Datos en BD (Python+MySQL)

### IPN UPIIC | Bases de Datos | Mtro. Carlos Basulto (2021)

En Python comenzaremos por cargar la librería "mySQL Connector", previamente instalado el driver en el equipo.  El driver se encuentra en https://www.mysql.com/downloads/

In [5]:
import mysql.connector as mysql

Ahora es necesario establecer la conexión a la base de datos, en este caso vamos a conectarnos a un servidor remoto que se encuentra en la nube.  Es importante recordar que para este paso ya debemos contar con un usuario y constraseña válidos para acceder al servidor y administrar bases de datos.

También es importante recordar que tanto el firewall de la red como del servidor, deben permitir el tráfico al puerto del DBMS que estamos usando; para este caso el puerto de MySQL es el **TCP 3306**.

In [7]:
#Puede ser necesario actualizar los datos de conexión al servidor MySQL en AWS
db=mysql.connect (
    host="18.117.107.114",
    user="sysadmin",
    password="upiic2020",
    database="demojoin"
)

A fin de realizar las operaciones sobre la base de datos con el driver de mysql.connector es necesario definir una variable que hará uso de los métodos necesarios para manipular la estructura y datos de la base de datos a la que nos hemos conectado.

In [16]:
cursor = db.cursor()

Para probar nuestra conexión ejecutaremos una sentencia de SQL a la base de datos, utilizando el método **"EXECUTE"** de la clase Cursor de mySQL Connector.  Puedes encontrar más información en https://dev.mysql.com/doc/connector-python/en/connector-python-api-mysqlcursor.html

In [17]:
cursor.execute("SELECT * FROM alumno")

In [18]:
resultado = cursor.fetchall()

In [19]:
resultado

[(24, 'Pedro T', 21, None),
 (34, 'Mina F', 22, None),
 (40, 'Melisa', None, None),
 (123, 'JOSE X', 21, None),
 (321, 'Pepe B', 18, None),
 (768, 'Gaby T', 21, None),
 (876, 'Myriam C', 19, None)]

Confirmado que todo está bien, procedamos a insertar un dato a la tabla "Alumno" de la base de datos.

In [20]:
insertData = "INSERT INTO alumno (idAlumno,nombreAlumno,edadAlumno) VALUES (%s,%s,%s)"

In [35]:
data=(26,"Pedrito Rodriguez P",18)

In [36]:
cursor.execute(insertData,data)

Veamos como quedo ingresada la nueva información en la tabla:

In [37]:
cursor.execute("SELECT * FROM alumno")

In [38]:
resultado = cursor.fetchall()

In [39]:
resultado

[(24, 'Pedro T', 21, None),
 (25, 'Josefina P', 21, None),
 (26, 'Pedrito Rodriguez P', 18, None),
 (34, 'Mina F', 22, None),
 (40, 'Melisa', None, None),
 (123, 'JOSE X', 21, None),
 (321, 'Pepe B', 18, None),
 (768, 'Gaby T', 21, None),
 (876, 'Myriam C', 19, None)]

Por último confirmemos los cambios a la base de datos a través del commando "Commit":

In [40]:
db.commit()

## Ejemplo de Uso Datos Obtenido desde una Base de Datos

Continuando con el ejemplo anterior, utilizaremos la libreria de Pandas para Python para observar una de tantas aplicaciones que se puede dar a una consulta de datos en una base de datos.

In [41]:
import pandas as pd

In [42]:
#Convertir el resultado del Query de SQL en un Datafrace en Pandas
df = pd.DataFrame(resultado, columns=cursor.column_names)

In [43]:
df

   idAlumno         nombreAlumno  edadAlumno alumnocol
0        24              Pedro T        21.0      None
1        25           Josefina P        21.0      None
2        26  Pedrito Rodriguez P        18.0      None
3        34               Mina F        22.0      None
4        40               Melisa         NaN      None
5       123               JOSE X        21.0      None
6       321               Pepe B        18.0      None
7       768               Gaby T        21.0      None
8       876             Myriam C        19.0      None

In [44]:
standard_deviation = df['edadAlumno'].std()
average = df['edadAlumno'].mean()
med = df['edadAlumno'].median()

In [45]:
print("La estadística descriptiva de los datos de calificaciones de alumnos es la siguiente:")
print("Desviación estándar: " + str(standard_deviation))
print("Media: " + str(average))
print("Mediana: "+ str(med))

La estadística descriptiva de los datos de calificaciones de alumnos es la siguiente:
Desviación estándar: 1.5526475085202969
Media: 20.125
Mediana: 21.0

Ahora experimenta y aprovecha el nuevo conocimiento para realizar tus programas y explotar el máximo la información.

Mtro. Carlos Basulto (2021).
Bases de Datos | Ciencia de Datos.
###### Unidad Profesional Interdisciplinaria de Ingeniería Campus Coahuila (2021)